Revit 2026 API

# MEPCurveDiameter Property

---

The diameter of the MEP curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Diameter { get; }
```
```vb
Public ReadOnly Property Diameter As Double
	Get
```
```cpp
public:
property double Diameter {
	double get ();
}
```
```fsharp
member Diameter : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the MEP curve's Shape is not round. |

This property is used to retrieve the diameter of the MEP curve.

#### Reference

MEPCurve Class

Autodesk.Revit.DB Namespace